FIRST_ADD = """
Всім привіт! 👋
Я Собірала ДН і ось, що я вмію:
▪ вести календар днів народження та повідомляти про наближення ДН (у особистих повідомленнях);
▪ автоматично створювати чати для обговорення кожного майбутнього ДН, таємно від іменинників;
▪ оригінально вітати винуватців урочистостей у групі.

Ну що почнемо? Просто шепніть мені в особистому повідомленні дату народження. Ваш вік залишиться у секреті 🤐

<b>Для цього натисніть кнопку 👇, а потім «Старт».</b>
"""

ADD_MEMBER = """
Ласкаво просимо, <a href="tg://user?id={id}">{username}</a> 👋
Я відстежую дні народження у цій групі, допомагаю готувати для іменинників сюрпризи та вітаю їх.

Шепніть мені вашу дату народження в особистому повідомленні - натисніть кнопку 👇, а потім "Старт". Ваш вік залишиться у секреті.
"""

NOT_COMMAND = """
Цю та інші команди потрібно надсилати мені <a href="https://t.me/{link}">особистим повідомленням</a> 🙂
"""
