START = """
Невідома чи неактивна команда 🤔
Список команд та допомога - /help
"""

HELP = """
Про Собіралу
Я допомагаю учасникам колективів не забувати про дні народження один одного. Докладніше: url

Як я працюю
1. Додайте мене до групового чату, де потрібно відстежувати дні народження. Ось зручне посилання для цього: t.me/sobiralaDNBot?startgroup=1
Не турбуйтеся, мені не потрібно бути адміністратором у групі, і я не вмію читати листування 🙈

2. Після додавання до групи я запропоную учасникам повідомити дати народження. Вони зможуть це зробити в особистому листуванні зі мною. Вік учасників залишиться у секреті.

3. Дізнавшись дати народження, я почну:
- нагадувати про майбутні ДР потай від іменинників (приватно, в особистих повідомленнях);
- Вітати іменинників у групі.

Переглядати календар днів народження групи та отримувати повідомлення про майбутні ДР можуть лише ті, хто вніс свою дату народження до календаря групи.

Команди у цьому чаті
/calendar — переглянути всі дні народження
/reset - змінити дані про себе
/removeme - видалити дані про себе
/donate - допомогти проекту Собірап

Команди у груповому чаті
/start — Вивести повідомлення з пропозицією додати ДР до календаря групи
/collect — увімкнути чи вимкнути збори грошей (тільки для адміністраторів групи)

Корисні посилання
Допомога та FAQ - url/help
Технічна підтримка - support_bot
Новини проекту - news channel
"""

ADD = """
Вітання! Давайте додамо вашу дату народження до календаря групи <b>«{groupname}»</b>.
"""

YEAR = """
Почнемо з року народження - надішліть мені 4 цифри. Ця інформація тільки для мене, і я нікому не повідомлю ваш вік 🤐
"""

NOT_YEAR = """
Не схоже на рік. Спробуйте ввести 4 цифри. Наприклад: 2005.
"""

MONTH = """
Добре. Оберіть місяць народження, будь ласка.
"""

NOT_MONTH = """
Не схоже на місяць. Виберіть опцію на спеціальній клавіатурі або надішліть назву місяця текстом, без скорочень.
"""

DAY = """
Зрозумів. Тепер введіть день народження.
"""

NOT_DAY = """
Не схоже на день. Спробуйте ще раз – мені потрібна одна чи дві цифри. приклад: 19.
"""

GENDER = """
Вкажіть вашу підлогу, щоб я міг грамотно звертатися до вас.
"""

NOT_GENDER = """
Будь ласка, виберіть опцію на спеціальній клавіатурі або надішліть мені "Ч" або "Ж".
"""

TOWN = """
Чудово! Останнє питання. Для коректної роботи мені важливо розуміти, в якій тимчасовій зоні ви знаходитесь. Надішліть мені назву вашого міста.
"""

RESET = """
⚠️⚠️⚠️ Будьте уважні, у вас є лише одна спроба змінити дані.

Наступного разу зможете змінити дані лише за кілька місяців.

Ви впевнені, що хочете змінити дані про себе (дата народження, стать, годинна зона)? Якщо ні, просто проігноруйте це повідомлення.
"""