START = """
Невідома чи неактивна команда 🤔
Список команд та допомога - /help
"""

HELP = """
Про Собіралу
Я допомагаю учасникам колективів не забувати про дні народження один одного. Докладніше: url

Як я працюю
1. Додайте мене до групового чату, де потрібно відстежувати дні народження. Ось зручне посилання для цього: t.me/sobirapp_bot?startgroup=1
Не турбуйтеся, мені не потрібно бути адміністратором у групі, і я не вмію читати листування 🙈

2. Після додавання до групи я запропоную учасникам повідомити дати народження. Вони зможуть це зробити в особистому листуванні зі мною. Вік учасників залишиться у секреті.

3. Дізнавшись дати народження, я почну:
- нагадувати про майбутні ДР потай від іменинників (приватно, в особистих повідомленнях);
- Вітати іменинників у групі.

Переглядати календар днів народження групи та отримувати повідомлення про майбутні ДР можуть лише ті, хто вніс свою дату народження до календаря групи.

Команди у цьому чаті
/calendar — переглянути всі дні народження
/reset - змінити дані про себе
/removeme - видалити дані про себе
/donate - допомогти проекту Собірап

Команди у груповому чаті
/start — Вивести повідомлення з пропозицією додати ДР до календаря групи
/collect — увімкнути чи вимкнути збори грошей (тільки для адміністраторів групи)

Корисні посилання
Допомога та FAQ - url/help
Технічна підтримка - support_bot
Новини проекту - news channel
"""